Revit 2027 API
Gradient.GradientInterpolation Property
 The property labeled "Interpolation" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GradientInterpolation { get; }
Public Shared ReadOnly Property GradientInterpolation As String
	Get
public:
static property String^ GradientInterpolation {
	String^ get ();
}
static member GradientInterpolation : string with get
Property Value
String
Remarks
 This property is a "AssetPropertyList" of type "AssetPropertyInteger".
See Also
Reference
Gradient Class
Autodesk.Revit.DB.Visual Namespace